; Translation file for AltDrag 1.0
; ru-RU localization by Neek Eoneof, Dmitry Trubin
; Simply put this file in the same directory as AltDrag, then reload AltDrag.
; Please read the website for help: https://stefansundin.github.io/altdrag/doc/translate.html
; Use encoding UTF-16LE with BOM to be able to use Unicode

[Translation]
Code=ru-RU
LangEnglish=Russian
Lang=Русский
Author=Neek Eoneof, Dmitry Trubin

TrayEnabled=AltDrag
TrayDisabled=AltDrag (выключено)
MenuEnable=Включить
MenuDisable=Выключить
MenuHideTray=Спрятать иконку
MenuUpdateAvailable=Доступно обновление!
MenuConfigure=Настройки
MenuAbout=О программе
MenuExit=Выход

UpdateBalloon=Обнаружена новая версия!
UpdateDialog=Доступна новая версия. Прейти на сайт программы?
UpdateLatest=Нет доступных обновлений.

ConfigTitle=Настройки AltDrag
ConfigTabGeneral=Основные
ConfigTabInput=Мышь и клавиатура
ConfigTabBlacklist=Черный список
ConfigTabAdvanced=Дополнительные
ConfigTabAbout=О программе

GeneralBox=Основные настройки
GeneralAutoFocus=&Активировать окно при перетаскивании.\nИначе, с зажатой клавишей Ctrl.
GeneralAero=&Имитировать Aero Snap
GeneralInactiveScroll=&Прокручивать содержимое неактивных окон
GeneralMDI=П&оддержка многодокументного интерфейса (MDI)
GeneralAutoSnap=Автоматическая стыковка:
GeneralAutoSnap0=Отключена
GeneralAutoSnap1=К краям экрана
GeneralAutoSnap2=+ к окнам снаружи
GeneralAutoSnap3=+ к окнам изнутри
GeneralLanguage=Язык:
GeneralAutostartBox=Автозагрузка
GeneralAutostart=&Запускать AltDrag при загрузке системы
GeneralAutostartHide=Прятать иконку в &области уведомлений
GeneralAutostartElevate=&Дать программе полномочия администратора
GeneralAutostartElevateTip=Подтверждение UAC будет запрашиваться при каждом входе в систему, если не отключить UAC полностью.
GeneralElevate=П&овысить
GeneralElevated=Повышено
GeneralElevateTip=Новый экземпляр AltDrag будет запущен от имени администратора. Это позволит программе AltDrag управлять другими приложениями, запущенными от имени администратора.\n\nНеобходимо выполнить подтверждение UAC, чтёобы разрешить запуск AltDrag с полномочиями администратора.
GeneralElevationAborted=Повышение полномочий отменено.
GeneralAutosave=Внимание, настройки применяются немедленно!

InputMouseBox=Действия мыши
InputMouseLMB=Левая кнопка:
InputMouseMMB=Средняя кнопка:
InputMouseRMB=Правая кнопка:
InputMouseMB4=Кнопка мыши 4:
InputMouseMB5=Кнопка мыши 5:
InputMouseScroll=Колесо прокрутки:
InputMouseLowerWithMMB=&Перемещать окно на задний план кликом средней кнопки по заголовку

InputActionMove=Переместить
InputActionResize=Размер
InputActionClose=Закрыть
InputActionMinimize=Свернуть
InputActionLower=На задний план
InputActionAlwaysOnTop=Поверх всех окон
InputActionBorderless=Toggle borderless
InputActionCenter=Установить по центру
InputActionNothing=Ничего
InputActionAltTab=Alt+Tab
InputActionVolume=Громкость
InputActionTransparency=Прозрачность

InputHotkeysBox=Горячие клавиши
InputHotkeysLeftAlt=&Левый Alt
InputHotkeysRightAlt=&Правый Alt
InputHotkeysLeftWinkey=Левый &Win
InputHotkeysRightWinkey=Правый W&in
InputHotkeysLeftCtrl=Левый &Ctrl
InputHotkeysRightCtrl=Правый C&trl
InputHotkeysMore=Вы можете добавить любую клавишу, изменив ini-файл.\nИспользуйте Shift для стыковки окон друг к другу.

BlacklistBox=Настройки черного списка
BlacklistProcessBlacklist=Черный список процессов:
BlacklistBlacklist=Черный список:
BlacklistSnaplist=Окна для стыковки:
BlacklistExplanation=Прочтите <a href="https://stefansundin.github.io/altdrag/doc/blacklist.html">вики-статью</a> на сайте с подробным описанием принципа работы черного списка!
BlacklistFindWindowBox=Определить окно
BlacklistFindWindowExplanation=Используйте эту функцию, чтобы определить имя класса окна и добавить его в списки выше.

AdvancedBox=Дополнительные настройки
AdvancedHookWindows=Включить стыковку при перетаскавании окна за заголовок.\nРаботает в связке с автоматической стыковкой!
AdvancedHookWindowsWarn=Имейте в виду, при включении этой функции, AltDrag может конфликтовать, например, с играми с системой защиты от жульничества.\n\nВключить стыковку?
AdvancedUpdateCheckOnStartup=&Автоматически проверять наличие обновлений
AdvancedUpdateBeta=Проверять наличие &бета-версий
AdvancedUpdateCheckNow=&Проверить
AdvancedIni=Настройки программы хранятся в файле AltDrag.ini. Некоторые настройки можно изменить только вручную через этот файл.
AdvancedOpenIni=&Открыть .ini

AboutBox=О программе AltDrag
AboutVersion=Версия
AboutAuthor=Разработал Stefan Sundin
AboutLicense=AltDrag — бесплатная программа с открытым исходным кодом. Расскажите о ней друзьям!
AboutDonate=&Помочь
AboutTranslationCredit=Авторы перевода

MiscUnhookError=Произошла ошибка при выключении AltDrag. Скорее всего это вызвано тем, что Windows уже отключила перехватчики AltDrag.\n\nЕсли это произошло впервые, вы можете проигнорировать это сообщение и продолжить пользоваться программой как обычно.\n\nЕсли это уже случалось ранее, решение проблемы можно найти в разделе 'AltDrag mysteriously stops working' вики-статьи About на сайте программы.
